tap "brewsci/science"
tap "cjbassi/gotop"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "shivammathur/php"
tap "hashicorp/tap"
brew "zstd"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "grpc"
brew "python@3.14"
brew "apache-arrow"
brew "awscli"
brew "libssh2"
brew "bat"
brew "black"
brew "boost"
brew "gettext"
brew "cairo"
brew "pycparser"
brew "cffi"
brew "cgal"
brew "code-minimap"
brew "curl"
brew "freetds"
brew "libavif"
brew "webp"
brew "gd"
brew "php"
brew "composer"
brew "dnsmasq"
brew "docker-compose"
brew "docutils"
brew "dotnet@9", link: true
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "geos"
brew "libidn2"
brew "gnutls"
brew "gnupg"
brew "gpgme"
brew "hdf5"
brew "proj"
brew "shared-mime-info"
brew "libheif"
brew "libspatialite"
brew "netcdf"
brew "numpy"
brew "poppler"
brew "sfcgal"
brew "gdal"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-flow"
brew "gotop"
brew "htop"
brew "imagemagick"
brew "lazygit"
brew "libdap"
brew "mkcert"
brew "mole"
brew "neovim"
brew "nginx"
brew "node"
brew "nvm"
brew "openjdk@17"
brew "perl"
brew "php@8.1"
brew "pipx"
brew "pnpm"
brew "postgis"
brew "postgresql@14", restart_service: :changed
brew "postgresql@15"
brew "pure"
brew "python@3.10"
brew "python@3.12"
brew "python@3.9"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "stylua"
brew "hashicorp/tap/terraform"
brew "tmux"
brew "uv"
brew "vim"
brew "virtualenv"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "fsouza/prettierd/prettierd"
brew "shivammathur/php/php@7.4"
cask "font-hack-nerd-font"
cask "iterm2"
cask "ngrok"
cask "ollama-app"
vscode "akamud.vscode-theme-onedark"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "batisteo.vscode-django"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dnamsons.kimbie-dark-plus"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "harryhopkinson.vim-theme"
vscode "jaakko.black"
vscode "kazte.kanagawa-kazte-vscode-color-theme"
vscode "kolo.kolo"
vscode "ludoloops.ayutokyo"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "pixl-garden.bongocat"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "qufiwefefwoyn.kanagawa"
vscode "ransh.ransh"
vscode "redhat.vscode-yaml"
vscode "rokoroku.vscode-theme-darcula"
vscode "siris01.catppuccin-theme"
vscode "teabyii.ayu"
vscode "teamsdevapp.ms-teams-vscode-extension"
vscode "tomrijndorp.find-it-faster"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xdebug.php-debug"
vscode "xinche.theme-demo"
vscode "yoavbls.pretty-ts-errors"
cargo "tree-sitter-cli"
npm "@aikidosec/safe-chain"
npm "corepack"
npm "lighthouse"
npm "prettier"
npm "typescript-language-server"
npm "typescript"
